app/controllers/records_controller.rb

    def create
        @record = Record.new(record_params)

        if @record.save
---
INSERT INTO "records" ("title", "amount", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "EU 1"], ["amount", 800.0], ["date", "2001-01-01"], ["created_at", "2017-10-16 17:22:55.017679"], ["updated_at", "2017-10-16 17:22:55.017679"]]